--
-- DebugManager.lua
-- Author: zheng.che
-- Date: 2014-05-27 14:26:05
-- debug管理
--

DebugManager = {}

-----------------------------------------------------------------------------------
-- 添加错误信息
-----------------------------------------------------------------------------------
function DebugManager.addError(str)
	print("[error]" .. str)
end

-----------------------------------------------------------------------------------
-- 断言
-- bool 断言条件 若结果为false 则认为断言失败
-- str 断言失败时打印的内容
-----------------------------------------------------------------------------------
function DebugManager.assert(bool, str)
	if not bool then
		print("[断言失败]" .. str)
	end
end